In [1]:
import pandas as pd

In [4]:
print(pd.__version__) # To check the version of pandas im woring with right now

2.2.3

In [7]:
A = pd.Series([23,5,55,1],index=['a','b','c','d'])
A

a    23
b     5
c    55
d     1
dtype: int64

In [11]:
print(A.values)
print(type(A.values))       # what type of array
print(type(A))              # what is the type of A

[23  5 55  1]
<class 'numpy.ndarray'>
<class 'pandas.core.series.Series'>

In [12]:
print(A.index)
print(type(A.index))

Index(['a', 'b', 'c', 'd'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

In [14]:
A['b':'d']  # access from b to d here final index is included

b     5
c    55
d     1
dtype: int64

In [21]:
# pandas series
grades_dict = {'a':90,'b':98,'c':88,'d':94}
grades = pd.Series(grades_dict)
grades.values

array([90, 98, 88, 94])

In [22]:
gpa_dict = {'a':2,'b':3,'c':2,'d':3}
gpa = pd.Series(gpa_dict)
gpa

a    2
b    3
c    2
d    3
dtype: int64

In [23]:
# Pandas Data Frame

S = pd.DataFrame({'GPA':gpa, 'GRADES':grades})
S

   GPA  GRADES
a    2      90
b    3      98
c    2      88
d    3      94

In [24]:
S.T

         a   b   c   d
GPA      2   3   2   3
GRADES  90  98  88  94

In [36]:
S['MARKS'] = S['GRADES']+2      # add new column
S

   GPA  GRADES  MARKS
a    2      90     92
b    3      98    100
c    2      88     90
d    3      94     96

In [37]:
del S['MARKS']  # delete column works like dicitionary
S

   GPA  GRADES
a    2      90
b    3      98
c    2      88
d    3      94

In [41]:
# Pandas NaN = missing values

X = pd.DataFrame([{'m':5, 'n':8},{'n':1,'z':2}])
X

     m  n    z
0  5.0  8  NaN
1  NaN  1  2.0